In [147]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [148]:
df = pd.read_excel('flight_price.xlsx')
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [150]:
df['Date'] = df['Date_of_Journey'].apply(lambda x: int(x.split('/')[0]))
df['Month'] = df['Date_of_Journey'].str.split('/').str[1]
df['Year'] = df['Date_of_Journey'].str.split('/').str[2]

In [151]:
df["Month"] = df["Month"].astype(int)
df["Year"] = df["Year"].astype(int)

In [152]:
df.drop('Date_of_Journey', inplace = True, axis=1)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Arrival_Time     10683 non-null  object
 6   Duration         10683 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10683 non-null  object
 9   Price            10683 non-null  int64
 10  Date             10683 non-null  int64
 11  Month            10683 non-null  int64
 12  Year             10683 non-null  int64
dtypes: int64(4), object(9)
memory usage: 1.1+ MB

In [153]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019

In [154]:
df["Arrival_Hours"] = df['Arrival_Time'].apply(lambda x: int(x.split(':')[0]))
df["Arrival_Minutes"] = df['Arrival_Time'].apply(lambda x: int(x.split(':')[1][:2]))

df.drop("Arrival_Time", axis=1, inplace=True)

In [155]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hours,Arrival_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897,24,3,2019,1,10
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,7h 25m,2 stops,No info,7662,1,5,2019,13,15

In [156]:
df["Dep_Hours"] = df['Dep_Time'].apply(lambda x: int(x.split(':')[0]))
df["Dep_Minutes"] = df['Dep_Time'].apply(lambda x: int(x.split(':')[1][:2]))

df.drop("Dep_Time", inplace=True, axis=1)

In [157]:
df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hours,Arrival_Minutes,Dep_Hours,Dep_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2 stops,No info,7662,1,5,2019,13,15,5,50

In [158]:
df.drop(['Route', 'Additional_Info'], inplace=True, axis=1)

In [159]:
print(df['Total_Stops'].unique())  # We have a nan value
print(df["Total_Stops"].isnull().sum())

['non-stop' '2 stops' '1 stop' '3 stops' nan '4 stops']
1

In [160]:
df["Total_Stops"].mode()

0    1 stop
Name: Total_Stops, dtype: object

In [161]:
df['Total_Stops'] = df["Total_Stops"].map({'non-stop': 0, '1 stop': 1, '2 stops': 2, '3 stops': 3, '4 stops': 4, np.nan: 1})

In [162]:
df.head()

,Airline,Source,Destination,Duration,Total_Stops,Price,Date,Month,Year,Arrival_Hours,Arrival_Minutes,Dep_Hours,Dep_Minutes
0,IndiGo,Banglore,New Delhi,2h 50m,0,3897,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,7h 25m,2,7662,1,5,2019,13,15,5,50
2,Jet Airways,Delhi,Cochin,19h,2,13882,9,6,2019,4,25,9,25
3,IndiGo,Kolkata,Banglore,5h 25m,1,6218,12,5,2019,23,30,18,5
4,IndiGo,Banglore,New Delhi,4h 45m,1,13302,1,3,2019,21,35,16,50

In [163]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder()

data = encoder.fit_transform(df[['Airline', 'Source', "Destination"]]).toarray()

In [164]:
df_encoded = pd.DataFrame(data, columns=encoder.get_feature_names_out(['Airline', 'Source', "Destination"]))
df_encoded.head()

,Airline_Air Asia,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Trujet,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0

In [165]:
df = pd.concat([df, df_encoded], axis=1)

df.drop(['Airline', 'Source', "Destination"], axis=1, inplace=True)
df.head()

,Duration,Total_Stops,Price,Date,Month,Year,Arrival_Hours,Arrival_Minutes,Dep_Hours,Dep_Minutes,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,2h 50m,0,3897,24,3,2019,1,10,22,20,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,7h 25m,2,7662,1,5,2019,13,15,5,50,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
2,19h,2,13882,9,6,2019,4,25,9,25,...,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,5h 25m,1,6218,12,5,2019,23,30,18,5,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
4,4h 45m,1,13302,1,3,2019,21,35,16,50,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0

In [169]:
# extract hours and minutes with a regex
df[['h','m']] = df['Duration'].str.extract(r'(?:(\d+)\s*h)?\s*(?:(\d+)\s*m)?')

# replace NaN with 0 and convert to ints
df['h'] = df['h'].fillna(0).astype(int)
df['m'] = df['m'].fillna(0).astype(int)

df.drop('Duration', axis=1, inplace=True)

In [170]:
df.head()

,Total_Stops,Price,Date,Month,Year,Arrival_Hours,Arrival_Minutes,Dep_Hours,Dep_Minutes,Airline_Air Asia,...,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi,h,m
0,0,3897,24,3,2019,1,10,22,20,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,2,50
1,2,7662,1,5,2019,13,15,5,50,0.0,...,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,7,25
2,2,13882,9,6,2019,4,25,9,25,0.0,...,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,19,0
3,1,6218,12,5,2019,23,30,18,5,0.0,...,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,5,25
4,1,13302,1,3,2019,21,35,16,50,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,4,45

In [171]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 34 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Total_Stops                                10683 non-null  int64
 1   Price                                      10683 non-null  int64
 2   Date                                       10683 non-null  int64
 3   Month                                      10683 non-null  int64
 4   Year                                       10683 non-null  int64
 5   Arrival_Hours                              10683 non-null  int64
 6   Arrival_Minutes                            10683 non-null  int64
 7   Dep_Hours                                  10683 non-null  int64
 8   Dep_Minutes                                10683 non-null  int64
 9   Airline_Air Asia                           10683 non-null  float64
 10  Airline_Air India                          10683 non-null  float64
 11  Airline_GoAir                              10683 non-null  float64
 12  Airline_IndiGo                             10683 non-null  float64
 13  Airline_Jet Airways                        10683 non-null  float64
 14  Airline_Jet Airways Business               10683 non-null  float64
 15  Airline_Multiple carriers                  10683 non-null  float64
 16  Airline_Multiple carriers Premium economy  10683 non-null  float64
 17  Airline_SpiceJet                           10683 non-null  float64
 18  Airline_Trujet                             10683 non-null  float64
 19  Airline_Vistara                            10683 non-null  float64
 20  Airline_Vistara Premium economy            10683 non-null  float64
 21  Source_Banglore                            10683 non-null  float64
 22  Source_Chennai                             10683 non-null  float64
 23  Source_Delhi                               10683 non-null  float64
 24  Source_Kolkata                             10683 non-null  float64
 25  Source_Mumbai                              10683 non-null  float64
 26  Destination_Banglore                       10683 non-null  float64
 27  Destination_Cochin                         10683 non-null  float64
 28  Destination_Delhi                          10683 non-null  float64
 29  Destination_Hyderabad                      10683 non-null  float64
 30  Destination_Kolkata                        10683 non-null  float64
 31  Destination_New Delhi                      10683 non-null  float64
 32  h                                          10683 non-null  int64
 33  m                                          10683 non-null  int64
dtypes: float64(23), int64(11)
memory usage: 2.8 MB

### Now it is ready to get fed to a ML model